# Очистка данных

# Загрузка библиотек

Загрузим библиотеки pandas и numpy

In [1]:
import pandas as pd
import numpy as np

Не смог загрузить файл из облака, поэтому загрузил датасет с помощью метода pd.read_csv() в формате .csv с локального диска, положив его в одну папку с данной тетрадкой ipynb

In [2]:
url = "https://raw.githubusercontent.com/IvanFedoseenko/datasets/main/airline_portcountry.csv"
df = pd.read_csv(url)

При помощи метода .columns посмотрим названия столбцов в загруженном датасете

In [3]:
df.head()

,Month,Airline,Port_Country,Passengers_In,Freight_In_(tonnes),Mail_In_(tonnes),Passengers_Out,Freight_Out_(tonnes),Mail_Out_(tonnes),Year,Month_num
0,Jan-85,Air Caledonie,New Caledonia,725.0,0.368,0.0,474.0,0.167,0.0,1985,1
1,Jan-85,Air China,China,1311.0,9.158,0.0,1232.0,2.587,0.0,1985,1
2,Jan-85,Air India,India,1423.0,44.823,0.0,970.0,6.708,0.0,1985,1
3,Jan-85,Air India,Singapore,501.0,10.583,0.0,306.0,124.966,0.0,1985,1
4,Jan-85,Air Nauru,Nauru,161.0,0.212,0.0,96.0,23.996,0.0,1985,1

In [4]:
df.columns

Index(['Month', 'Airline', 'Port_Country', 'Passengers_In',
       'Freight_In_(tonnes)', 'Mail_In_(tonnes)', 'Passengers_Out',
       'Freight_Out_(tonnes)', 'Mail_Out_(tonnes)', 'Year', 'Month_num'],
      dtype='object')

При помощи метода .info() узнаем количественное описание загруженного датасета.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43856 entries, 0 to 43855
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Month                 43856 non-null  object
 1   Airline               43856 non-null  object
 2   Port_Country          43856 non-null  object
 3   Passengers_In         43823 non-null  float64
 4   Freight_In_(tonnes)   43838 non-null  float64
 5   Mail_In_(tonnes)      43838 non-null  float64
 6   Passengers_Out        43824 non-null  float64
 7   Freight_Out_(tonnes)  43848 non-null  float64
 8   Mail_Out_(tonnes)     43848 non-null  float64
 9   Year                  43856 non-null  int64
 10  Month_num             43856 non-null  int64
dtypes: float64(6), int64(2), object(3)
memory usage: 3.7+ MB

Обратим основное внимание на количество ненулевых значений:
Всего - 43856 строк
По столбцу Passengers_Out из 43856 строк 43824 - ненулевые

Удалим строки, содержащие пустое значение хотя бы в одном из 11-ти столбцов с помощью метода .dropna(0, how='any'), где 0 означает удаление построчно, а how='any' - в случае отсутсвия значения хотя бы в одном столбце

In [6]:
df = df.dropna(0, how='any')

C:\Users\IFEDOS~1\AppData\Local\Temp/ipykernel_12140/1303843727.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.dropna will be keyword-only
  df = df.dropna(0, how='any')

Убедимся, что строки содержащие пустые значения хотя бы в одном столбце удалены. Ожидаем, что по всем столбцам кол-во ненулвых значений равно общему количеству строк. Проверим это, вызвав метод .info() снова

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43823 entries, 0 to 43855
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Month                 43823 non-null  object
 1   Airline               43823 non-null  object
 2   Port_Country          43823 non-null  object
 3   Passengers_In         43823 non-null  float64
 4   Freight_In_(tonnes)   43823 non-null  float64
 5   Mail_In_(tonnes)      43823 non-null  float64
 6   Passengers_Out        43823 non-null  float64
 7   Freight_Out_(tonnes)  43823 non-null  float64
 8   Mail_Out_(tonnes)     43823 non-null  float64
 9   Year                  43823 non-null  int64
 10  Month_num             43823 non-null  int64
dtypes: float64(6), int64(2), object(3)
memory usage: 4.0+ MB

Видим, что по всем столбцам кол-во ненулевых строк равно 43823 и эквивалентно общему кол-ву строк 43823. Взглянем на весь датасет с помощью метода .head()

In [8]:
df.head()

,Month,Airline,Port_Country,Passengers_In,Freight_In_(tonnes),Mail_In_(tonnes),Passengers_Out,Freight_Out_(tonnes),Mail_Out_(tonnes),Year,Month_num
0,Jan-85,Air Caledonie,New Caledonia,725.0,0.368,0.0,474.0,0.167,0.0,1985,1
1,Jan-85,Air China,China,1311.0,9.158,0.0,1232.0,2.587,0.0,1985,1
2,Jan-85,Air India,India,1423.0,44.823,0.0,970.0,6.708,0.0,1985,1
3,Jan-85,Air India,Singapore,501.0,10.583,0.0,306.0,124.966,0.0,1985,1
4,Jan-85,Air Nauru,Nauru,161.0,0.212,0.0,96.0,23.996,0.0,1985,1

Удалим строки за 2020-ый года и за 1-ый квартал 2021-го года.
С помощью метода .index найдем номера строк датасета по столбцу Year со значением 2020 и удалим их построчно (0) при помощи метода .drop()
Аналогично удалим строки за 1-ый квартал 2021-го года

In [9]:
df1 = df.drop(df[(df.Year == 2021) & (df.Month_num == 1)].index, 0)
df1 = df1.drop(df1[(df1.Year == 2020)].index, 0)

C:\Users\IFEDOS~1\AppData\Local\Temp/ipykernel_12140/11027258.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  df1 = df.drop(df[(df.Year == 2021) & (df.Month_num == 1)].index, 0)
C:\Users\IFEDOS~1\AppData\Local\Temp/ipykernel_12140/11027258.py:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  df1 = df1.drop(df1[(df1.Year == 2020)].index, 0)

Оценим результаты

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 42759 entries, 0 to 43855
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Month                 42759 non-null  object
 1   Airline               42759 non-null  object
 2   Port_Country          42759 non-null  object
 3   Passengers_In         42759 non-null  float64
 4   Freight_In_(tonnes)   42759 non-null  float64
 5   Mail_In_(tonnes)      42759 non-null  float64
 6   Passengers_Out        42759 non-null  float64
 7   Freight_Out_(tonnes)  42759 non-null  float64
 8   Mail_Out_(tonnes)     42759 non-null  float64
 9   Year                  42759 non-null  int64
 10  Month_num             42759 non-null  int64
dtypes: float64(6), int64(2), object(3)
memory usage: 3.9+ MB

Видим, что кол-во строк сократилось с 43823 ранее до 42759 после удаления 2020 и Q12021